## Creating a dataframe using List

In [3]:
# import pandas as pd
import pandas as pd
 
# list of strings
lst = ['Naruto','is','one','of','the','best','Anime']
 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

        0
0  Naruto
1      is
2     one
3      of
4     the
5    best
6   Anime

## Creating DataFrame from dict of narray/lists

In [5]:
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Naruto', 'Sasuke', 'Madara', 'Itachi','Kakashi'], 'Age':[16, 17, 90, 21,30]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
print(df)

      Name  Age
0   Naruto   16
1   Sasuke   17
2   Madara   90
3   Itachi   21
4  Kakashi   30

## Dealing with Rows and Columns
### Column Selection

In [7]:
# Import pandas package
import pandas as pd
 
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 'Age':[27, 24, 22, 32], 'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select two columns
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

### Row Selection

In [11]:
# importing pandas package
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("C:\\Olympics.csv", index_col ="Name")
 
# retrieving row by loc method
first = data.loc["Usain BOLT"]
second = data.loc["Justin GATLIN"]
 
print(first, "\n\n\n", second)

           Gender     Event   venues  Year Medal Country   Time
Name
Usain BOLT      M  100M Men  Beijing  2008     G     JAM   9.69
Usain BOLT      M  200M Men  Beijing  2008     G     JAM   19.3
Usain BOLT      M  100M Men   London  2012     G     JAM   9.63
Usain BOLT      M  200M Men   London  2012     G     JAM  19.32
Usain BOLT      M  100M Men      Rio  2016     G     JAM   9.81
Usain BOLT      M  200M Men      Rio  2016     G     JAM  19.78


               Gender     Event  venues  Year Medal Country   Time
Name
Justin GATLIN      M  100M Men  Athens  2004     G     USA   9.85
Justin GATLIN      M  200M Men  Athens  2004     B     USA  20.03
Justin GATLIN      M  100M Men  London  2012     B     USA   9.79
Justin GATLIN      M  100M Men     Rio  2016     S     USA   9.89

In [15]:
cd C:\\

C:\

In [16]:
# creating a Dataframe
import pandas as pd
cvs = pd.read_csv("Olympics.csv") 
df=pd.DataFrame(cvs)
df

,Gender,Event,venues,Year,Medal,Name,Country,Time
0,M,100M Men,Sydney,2000,G,Maurice GREENE,USA,9.87
1,M,100M Men,Sydney,2000,S,Ato BOLDON,TTO,9.99
2,M,100M Men,Sydney,2000,B,Obadele THOMPSON,BAR,10.04
3,M,110M Hurdles Men,Sydney,2000,G,Anier GARCIA,CUB,13
4,M,110M Hurdles Men,Sydney,2000,S,Terrence TRAMMELL,USA,13.16
...,...,...,...,...,...,...,...,...
110,M,5000M Men,Rio,2016,S,Paul Kipkemoi CHELIMO,USA,13:03.9
111,M,5000M Men,Rio,2016,B,Hagos GEBRHIWET,ETH,13:04.3
112,M,Marathon Men,Rio,2016,G,Eliud Kipchoge ROTICH,KEN,2:08:44
113,M,Marathon Men,Rio,2016,S,Feyisa LILESA,ETH,2:09:54
114,M,Marathon Men,Rio,2016,B,Galen RUPP,USA,2:10:05

## Indexing and Selecting Data
### Indexing a Dataframe using indexing operator []

In [19]:
# making data frame from csv file
data = pd.read_csv("Olympics.csv", index_col ="Name")
 
# retrieving columns by indexing operator
first = data["Year"]
print(first)

Name
Maurice GREENE           2000
Ato BOLDON               2000
Obadele THOMPSON         2000
Anier GARCIA             2000
Terrence TRAMMELL        2000
                         ...
Paul Kipkemoi CHELIMO    2016
Hagos GEBRHIWET          2016
Eliud Kipchoge ROTICH    2016
Feyisa LILESA            2016
Galen RUPP               2016
Name: Year, Length: 115, dtype: int64

## df.loc[ rows , columns ]

In [20]:
df.loc[48]

Gender              M
Event        100M Men
venues        Beijing
Year             2008
Medal               G
Name       Usain BOLT
Country           JAM
Time             9.69
Name: 48, dtype: object

In [21]:
df.loc[70:72]

   Gender     Event  venues  Year Medal           Name Country  Time
70      M  100M Men  London  2012     G     Usain BOLT     JAM  9.63
71      M  100M Men  London  2012     S    Yohan BLAKE     JAM  9.75
72      M  100M Men  London  2012     B  Justin GATLIN     USA  9.79

In [22]:
df.loc[[48,70,94]]

   Gender     Event   venues  Year Medal        Name Country  Time
48      M  100M Men  Beijing  2008     G  Usain BOLT     JAM  9.69
70      M  100M Men   London  2012     G  Usain BOLT     JAM  9.63
94      M  100M Men      Rio  2016     G  Usain BOLT     JAM  9.81

In [23]:
# columns are labled so we use label name
df.loc[0:5,['Name','Event','Medal']]

                Name             Event Medal
0     Maurice GREENE          100M Men     G
1         Ato BOLDON          100M Men     S
2   Obadele THOMPSON          100M Men     B
3       Anier GARCIA  110M Hurdles Men     G
4  Terrence TRAMMELL  110M Hurdles Men     S
5         Mark CREAR  110M Hurdles Men     B

In [24]:
df.loc[[48,49,50],['Name','Event','Year','Medal']]

                Name     Event  Year Medal
48        Usain BOLT  100M Men  2008     G
49  Richard THOMPSON  100M Men  2008     S
50        Walter DIX  100M Men  2008     B

## df.iloc[ rows , columns ]

In [25]:
# both rows and columns use index
df.iloc[0:5,1:6]   # end points not included

              Event  venues  Year Medal               Name
0          100M Men  Sydney  2000     G     Maurice GREENE
1          100M Men  Sydney  2000     S         Ato BOLDON
2          100M Men  Sydney  2000     B   Obadele THOMPSON
3  110M Hurdles Men  Sydney  2000     G       Anier GARCIA
4  110M Hurdles Men  Sydney  2000     S  Terrence TRAMMELL

In [26]:
df.iloc[[0,48,70,94],[3,4,5,7]]

    Year Medal            Name  Time
0   2000     G  Maurice GREENE  9.87
48  2008     G      Usain BOLT  9.69
70  2012     G      Usain BOLT  9.63
94  2016     G      Usain BOLT  9.81

## Working with Missing Data
### Checking for missing values using isnull() and notnull()

In [27]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95], 'Second Score': [30, 45, 56, np.nan], 'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from list
df = pd.DataFrame(dict)
 
# using isnull() function  
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

### Filling missing values using fillna(), replace() and interpolate()

In [28]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95], 'Second Score': [30, 45, 56, np.nan], 'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# filling missing value using fillna()  
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

### Dropping missing values using dropna()

In [29]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95], 'Second Score': [30, np.nan, 45, 56], 'Third Score':[52, 40, 80, 98], 'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)

# using dropna() function 
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

## Iterating over rows and columns
### Iterating over rows

In [31]:
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 'degree': ["MBA", "BCA", "M.Tech", "MBA"], 'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

### Iterating over Columns

In [32]:
# importing pandas as pd
import pandas as pd
   
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 'degree': ["MBA", "BCA", "M.Tech", "MBA"], 'score':[90, 40, 80, 98]}
  
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98